In [2]:
!pip install pandas
# 판다스 설치

Requirement already satisfied: pandas in /home/codespace/.local/lib/python3.10/site-packages (2.1.1)
Requirement already satisfied: numpy>=1.22.4 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [1]:
import pandas as pd
df = pd.DataFrame({
    'Name' : ['Alice', 'layla-focalors', 'arisia'],
    'LectureA' : [100,100,100],
    'LectureB' : [100,100,100]
}, columns=['Name', 'LectureA', 'LectureB'])
df

             Name  LectureA  LectureB
0           Alice       100       100
1  layla-focalors       100       100
2          arisia       100       100

In [9]:
df

             Name  LectureA  LectureB  LectureC
0           Alice       100       100       100
1  layla-focalors       100       100       100
2          arisia       100       100       100

In [8]:
df['LectureC'] = [100,100,100]

In [5]:
df['LectureA'].mean()

100.0

In [11]:
import pandas as pd
data = {'이름' : ['홍길동', '이순신', '김유신', '유관순'],
        '국어' : [82, 98, 92, 80],
        '수학' : [90, 88, 75, 86],
        '과학' : [100, 100, 100, 100]}

df = pd.DataFrame(data)
df

    이름  국어  수학   과학
0  홍길동  82  90  100
1  이순신  98  88  100
2  김유신  92  75  100
3  유관순  80  86  100

In [2]:
type(df)

pandas.core.frame.DataFrame

In [5]:
from numpy import NaN, nan, NAN
pd.isnull(nan)

True

In [4]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   국어      4 non-null      int64
 2   수학      4 non-null      int64
 3   과학      4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

In [12]:
# 열 이름(컬럼명) 바꾸기
df.columns = ['이름', '국어', '수학', '영어']
df

    이름  국어  수학   영어
0  홍길동  82  90  100
1  이순신  98  88  100
2  김유신  92  75  100
3  유관순  80  86  100

In [18]:
df[0:2]

    이름  국어  수학   영어
0  홍길동  82  90  100
1  이순신  98  88  100

In [19]:
df[['이름','국어']]

    이름  국어
0  홍길동  82
1  이순신  98
2  김유신  92
3  유관순  80

In [25]:
df.loc[:, ['이름','국어']]

    이름  국어
0  홍길동  82
1  이순신  98
2  김유신  92
3  유관순  80